[Survived] BlockStatement
backend/controllers/audit.controller.js:4:43
 const auditService = require("../services/audit.service");
 
 // GET TIMELINE
-exports.getTimeline = async (req, res) => {
-  try {
-    const { patientId } = req.params;
-
-    const events = await auditService.getPatientTimeline(patientId);
-
-    res.status(200).json(events);
-  } catch (err) {
-    res.status(500).json({ message: err.message });
-  }
-};
+exports.getTimeline = async (req, res) => {};

[Survived] BlockStatement
backend/controllers/audit.controller.js:5:7
 
 // GET TIMELINE
 exports.getTimeline = async (req, res) => {
-  try {
-    const { patientId } = req.params;
-
-    const events = await auditService.getPatientTimeline(patientId);
-
-    res.status(200).json(events);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ message: err.message });
   }

[Survived] BlockStatement
backend/controllers/audit.controller.js:11:17
     const events = await auditService.getPatientTimeline(patientId);
 
     res.status(200).json(events);
-  } catch (err) {
-    res.status(500).json({ message: err.message });
-  }
+  } catch (err) {}
 };
