[Survived] BlockStatement
backend/controllers/bed.controller.js:3:41
 const bedService = require("../services/bed.service");
 
-exports.createBed = async (req, res) => {
-  try {
-    const bed = await bedService.createBed(req.body);
-    res.status(201).json(bed);
-  } catch (error) {
-    res.status(400).json({ message: error.message });
-  }
-};
+exports.createBed = async (req, res) => {};
 
 exports.getAllBeds = async (req, res) => {

[Survived] BlockStatement
backend/controllers/bed.controller.js:4:7
 const bedService = require("../services/bed.service");
 
 exports.createBed = async (req, res) => {
-  try {
-    const bed = await bedService.createBed(req.body);
-    res.status(201).json(bed);
-  } catch (error) {
+  try {} catch (error) {
     res.status(400).json({ message: error.message });
   }

[Survived] BlockStatement
backend/controllers/bed.controller.js:7:19
   try {
     const bed = await bedService.createBed(req.body);
     res.status(201).json(bed);
-  } catch (error) {
-    res.status(400).json({ message: error.message });
-  }
+  } catch (error) {}
 };
 

[Survived] ObjectLiteral
backend/controllers/bed.controller.js:8:26
     const bed = await bedService.createBed(req.body);
     res.status(201).json(bed);
   } catch (error) {
-    res.status(400).json({ message: error.message });
+    res.status(400).json({});
   }
 };

[Survived] BlockStatement
backend/controllers/bed.controller.js:12:42
   }
 };
 
-exports.getAllBeds = async (req, res) => {
-  try {
-    const beds = await bedService.getAllBeds();
-    res.status(200).json(beds);
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
-};
+exports.getAllBeds = async (req, res) => {};
 
 exports.assignPatientToBed = async (req, res) => {

[Survived] BlockStatement
backend/controllers/bed.controller.js:13:7
 };
 
 exports.getAllBeds = async (req, res) => {
-  try {
-    const beds = await bedService.getAllBeds();
-    res.status(200).json(beds);
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ message: error.message });
   }

[Survived] BlockStatement
backend/controllers/bed.controller.js:16:19
   try {
     const beds = await bedService.getAllBeds();
     res.status(200).json(beds);
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
+  } catch (error) {}
 };
 

[Survived] BlockStatement
backend/controllers/bed.controller.js:21:50
   }
 };
 
-exports.assignPatientToBed = async (req, res) => {
-  try {
-    const result = await bedService.assignPatientToBed(
-      req.params.bedId,
-      req.params.patientId
-    );
-    res.status(200).json(result);
-  } catch (error) {
-    res.status(400).json({ message: error.message });
-  }
-};
+exports.assignPatientToBed = async (req, res) => {};

[Survived] BlockStatement
backend/controllers/bed.controller.js:22:7
 };
 
 exports.assignPatientToBed = async (req, res) => {
-  try {
-    const result = await bedService.assignPatientToBed(
-      req.params.bedId,
-      req.params.patientId
-    );
-    res.status(200).json(result);
-  } catch (error) {
+  try {} catch (error) {
     res.status(400).json({ message: error.message });
   }

[Survived] BlockStatement
backend/controllers/bed.controller.js:28:19
       req.params.patientId
     );
     res.status(200).json(result);
-  } catch (error) {
-    res.status(400).json({ message: error.message });
-  }
+  } catch (error) {}
 };
