[Survived] BlockStatement
backend/controllers/patient.controller.js:3:45
 const patientService = require("../services/patient.service");
 
-exports.createPatient = async (req, res) => {
-  try {
-    const patient = await patientService.createPatient(req.body);
-    res.status(201).json(patient);
-  } catch (error) {
-    res.status(400).json({ message: error.message });
-  }
-};
+exports.createPatient = async (req, res) => {};
 
 exports.getAllPatients = async (req, res) => {

[Survived] BlockStatement
backend/controllers/patient.controller.js:4:7
 const patientService = require("../services/patient.service");
 
 exports.createPatient = async (req, res) => {
-  try {
-    const patient = await patientService.createPatient(req.body);
-    res.status(201).json(patient);
-  } catch (error) {
+  try {} catch (error) {
     res.status(400).json({ message: error.message });
   }

[Survived] BlockStatement
backend/controllers/patient.controller.js:7:19
   try {
     const patient = await patientService.createPatient(req.body);
     res.status(201).json(patient);
-  } catch (error) {
-    res.status(400).json({ message: error.message });
-  }
+  } catch (error) {}
 };
 

[Survived] BlockStatement
backend/controllers/patient.controller.js:12:46
   }
 };
 
-exports.getAllPatients = async (req, res) => {
-  try {
-    const patients = await patientService.getAllPatients();
-    res.status(200).json(patients);
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
-};
+exports.getAllPatients = async (req, res) => {};
 
 exports.dischargePatient = async (req, res) => {

[Survived] BlockStatement
backend/controllers/patient.controller.js:13:7
 };
 
 exports.getAllPatients = async (req, res) => {
-  try {
-    const patients = await patientService.getAllPatients();
-    res.status(200).json(patients);
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ message: error.message });
   }

[Survived] BlockStatement
backend/controllers/patient.controller.js:16:19
   try {
     const patients = await patientService.getAllPatients();
     res.status(200).json(patients);
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
+  } catch (error) {}
 };
 

[Survived] BlockStatement
backend/controllers/patient.controller.js:21:48
   }
 };
 
-exports.dischargePatient = async (req, res) => {
-  try {
-    const patient = await patientService.dischargePatient(req.params.id);
-    res.status(200).json(patient);
-  } catch (error) {
-    res.status(404).json({ message: error.message });
-  }
-};
+exports.dischargePatient = async (req, res) => {};

[Survived] BlockStatement
backend/controllers/patient.controller.js:22:7
 };
 
 exports.dischargePatient = async (req, res) => {
-  try {
-    const patient = await patientService.dischargePatient(req.params.id);
-    res.status(200).json(patient);
-  } catch (error) {
+  try {} catch (error) {
     res.status(404).json({ message: error.message });
   }

[Survived] BlockStatement
backend/controllers/patient.controller.js:25:19
   try {
     const patient = await patientService.dischargePatient(req.params.id);
     res.status(200).json(patient);
-  } catch (error) {
-    res.status(404).json({ message: error.message });
-  }
+  } catch (error) {}
 };

[Survived] ObjectLiteral
backend/controllers/patient.controller.js:26:26
     const patient = await patientService.dischargePatient(req.params.id);
     res.status(200).json(patient);
   } catch (error) {
-    res.status(404).json({ message: error.message });
+    res.status(404).json({});
   }
 };
