[Survived] BlockStatement
backend/controllers/auth.controller.js:2:38
 const authService = require("../services/auth.service");
-exports.signup = async (req, res) => {
-  try {
-    const result = await authService.signup(req.body);
-    res.status(201).json(result);
-  } catch (error) {
-    res.status(400).json({ message: error.message });
-  }
-};
+exports.signup = async (req, res) => {};
 
 exports.login = async (req, res) => {

[Survived] BlockStatement
backend/controllers/auth.controller.js:3:7
 const authService = require("../services/auth.service");
 exports.signup = async (req, res) => {
-  try {
-    const result = await authService.signup(req.body);
-    res.status(201).json(result);
-  } catch (error) {
+  try {} catch (error) {
     res.status(400).json({ message: error.message });
   }

[Survived] BlockStatement
backend/controllers/auth.controller.js:6:19
   try {
     const result = await authService.signup(req.body);
     res.status(201).json(result);
-  } catch (error) {
-    res.status(400).json({ message: error.message });
-  }
+  } catch (error) {}
 };
 

[Survived] BlockStatement
backend/controllers/auth.controller.js:11:37
   }
 };
 
-exports.login = async (req, res) => {
-  try {
-    const result = await authService.login(req.body);
-    res.status(200).json(result);
-  } catch (error) {
-    res.status(401).json({ message: error.message });
-  }
-};
+exports.login = async (req, res) => {};

[Survived] BlockStatement
backend/controllers/auth.controller.js:12:7
 };
 
 exports.login = async (req, res) => {
-  try {
-    const result = await authService.login(req.body);
-    res.status(200).json(result);
-  } catch (error) {
+  try {} catch (error) {
     res.status(401).json({ message: error.message });
   }

[Survived] BlockStatement
backend/controllers/auth.controller.js:15:19
   try {
     const result = await authService.login(req.body);
     res.status(200).json(result);
-  } catch (error) {
-    res.status(401).json({ message: error.message });
-  }
+  } catch (error) {}
 };
