[Survived] BlockStatement
backend/controllers/ward.controller.js:3:42
 const wardService = require("../services/ward.service");
 
-exports.createWard = async (req, res) => {
-  try {
-    const ward = await wardService.createWard(req.body);
-    res.status(201).json(ward);
-  } catch (error) {
-    res.status(400).json({ message: error.message });
-  }
-};
+exports.createWard = async (req, res) => {};
 
 exports.getAllWards = async (req, res) => {

[Survived] BlockStatement
backend/controllers/ward.controller.js:4:7
 const wardService = require("../services/ward.service");
 
 exports.createWard = async (req, res) => {
-  try {
-    const ward = await wardService.createWard(req.body);
-    res.status(201).json(ward);
-  } catch (error) {
+  try {} catch (error) {
     res.status(400).json({ message: error.message });
   }

[Survived] BlockStatement
backend/controllers/ward.controller.js:7:19
   try {
     const ward = await wardService.createWard(req.body);
     res.status(201).json(ward);
-  } catch (error) {
-    res.status(400).json({ message: error.message });
-  }
+  } catch (error) {}
 };
 

[Survived] BlockStatement
backend/controllers/ward.controller.js:12:43
   }
 };
 
-exports.getAllWards = async (req, res) => {
-  try {
-    const wards = await wardService.getAllWards();
-    res.status(200).json(wards);
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
-};
+exports.getAllWards = async (req, res) => {};

[Survived] BlockStatement
backend/controllers/ward.controller.js:13:7
 };
 
 exports.getAllWards = async (req, res) => {
-  try {
-    const wards = await wardService.getAllWards();
-    res.status(200).json(wards);
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ message: error.message });
   }

[Survived] BlockStatement
backend/controllers/ward.controller.js:16:19
   try {
     const wards = await wardService.getAllWards();
     res.status(200).json(wards);
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
+  } catch (error) {}
 };

[Survived] ObjectLiteral
backend/controllers/ward.controller.js:17:26
     const wards = await wardService.getAllWards();
     res.status(200).json(wards);
   } catch (error) {
-    res.status(500).json({ message: error.message });
+    res.status(500).json({});
   }
 };
