[Survived] BlockStatement
backend/services/audit.service.js:4:39
 const AuditLog = require("../models/audit.model");
 
 // CREATE EVENT
-exports.createEvent = async (data) => {
-  const event = new AuditLog(data);
-  await event.save();
-  return event;
-};
+exports.createEvent = async (data) => {};
 
 // GET PATIENT TIMELINE

[Survived] BlockStatement
backend/services/audit.service.js:11:51
 };
 
 // GET PATIENT TIMELINE
-exports.getPatientTimeline = async (patientId) => {
-  return await AuditLog.find({ patient: patientId })
-    .sort({ createdAt: 1 }); // chronological
-};
+exports.getPatientTimeline = async (patientId) => {};

[Survived] MethodExpression
backend/services/audit.service.js:12:16
 
 // GET PATIENT TIMELINE
 exports.getPatientTimeline = async (patientId) => {
-  return await AuditLog.find({ patient: patientId })
-    .sort({ createdAt: 1 }); // chronological
+  return await AuditLog.find({
+  patient: patientId
+}); // chronological
 };

[Survived] ObjectLiteral
backend/services/audit.service.js:13:11
 // GET PATIENT TIMELINE
 exports.getPatientTimeline = async (patientId) => {
   return await AuditLog.find({ patient: patientId })
-    .sort({ createdAt: 1 }); // chronological
+    .sort({}); // chronological
 };
