[Survived] BlockStatement
backend/services/bed.service.js:6:37
 const auditService = require("./audit.service"); 
 const { canAssignBed } = require("../utils/bedLogic");
 
-exports.createBed = async (data) => {
-  const bed = new Bed(data);
-  await bed.save();
-  return bed;
-};
+exports.createBed = async (data) => {};
 
 exports.getAllBeds = async () => {

[Survived] BlockStatement
backend/services/bed.service.js:12:34
   return bed;
 };
 
-exports.getAllBeds = async () => {
-  return await Bed.find().populate("ward").populate("assignedPatient");
-};
+exports.getAllBeds = async () => {};
 
 exports.assignPatientToBed = async (bedId, patientId) => {

[Survived] BlockStatement
backend/services/bed.service.js:16:58
   return await Bed.find().populate("ward").populate("assignedPatient");
 };
 
-exports.assignPatientToBed = async (bedId, patientId) => {
-  const bed = await Bed.findById(bedId);
-  const patient = await Patient.findById(patientId);
-
-  const result = canAssignBed(bed, patient);
-
-  if (!result.allowed) {
-    throw new Error(result.reason);
-  }
-
-  bed.isOccupied = true;
-  bed.assignedPatient = patient._id;
-  await bed.save();
-
-  patient.bed = bed._id;
-  patient.ward = bed.ward;
-  patient.status = "Admitted";
-  await patient.save();
-
-  return { message: "Patient assigned successfully" };
-};
+exports.assignPatientToBed = async (bedId, patientId) => {};

[Survived] ConditionalExpression
backend/services/bed.service.js:22:7
 
   const result = canAssignBed(bed, patient);
 
-  if (!result.allowed) {
+  if (false) {
     throw new Error(result.reason);
   }

[Survived] BooleanLiteral
backend/services/bed.service.js:22:7
 
   const result = canAssignBed(bed, patient);
 
-  if (!result.allowed) {
+  if (result.allowed) {
     throw new Error(result.reason);
   }

[Survived] BooleanLiteral
backend/services/bed.service.js:26:20
     throw new Error(result.reason);
   }
 
-  bed.isOccupied = true;
+  bed.isOccupied = false;
   bed.assignedPatient = patient._id;
   await bed.save();

[Survived] ObjectLiteral
backend/services/bed.service.js:35:10
   patient.status = "Admitted";
   await patient.save();
 
-  return { message: "Patient assigned successfully" };
+  return {};
 };
