[Survived] BlockStatement
backend/services/auth.service.js:6:34
 const jwt = require("jsonwebtoken");
 require("dotenv").config();
 
-exports.signup = async (data) => {
-  const { email, password } = data;
-
-  const existing = await User.findOne({ email });
-  if (existing) {
-    throw new Error("User already exists");
-  }
-
-  const hashedPassword = await bcrypt.hash(password, 10);
-
-  const user = new User({
-    email,
-    password: hashedPassword,
-  });
-
-  await user.save();
-
-  return { message: "Signup successful" };
-};
+exports.signup = async (data) => {};
 
 exports.login = async (data) => {

[Survived] BlockStatement
backend/services/auth.service.js:10:17
   const { email, password } = data;
 
   const existing = await User.findOne({ email });
-  if (existing) {
-    throw new Error("User already exists");
-  }
+  if (existing) {}
 
   const hashedPassword = await bcrypt.hash(password, 10);

[Survived] ConditionalExpression
backend/services/auth.service.js:10:7
   const { email, password } = data;
 
   const existing = await User.findOne({ email });
-  if (existing) {
+  if (false) {
     throw new Error("User already exists");
   }

[Survived] ObjectLiteral
backend/services/auth.service.js:23:10
 
   await user.save();
 
-  return { message: "Signup successful" };
+  return {};
 };
 

[Survived] ObjectLiteral
backend/services/auth.service.js:29:35
 exports.login = async (data) => {
   const { email, password } = data;
 
-  const user = await User.findOne({ email });
+  const user = await User.findOne({});
   if (!user) {
     throw new Error("Invalid credentials");

[Survived] ConditionalExpression
backend/services/auth.service.js:30:7
   const { email, password } = data;
 
   const user = await User.findOne({ email });
-  if (!user) {
+  if (false) {
     throw new Error("Invalid credentials");
   }

[Survived] BlockStatement
backend/services/auth.service.js:30:14
   const { email, password } = data;
 
   const user = await User.findOne({ email });
-  if (!user) {
-    throw new Error("Invalid credentials");
-  }
+  if (!user) {}
 
   const isMatch = await bcrypt.compare(password, user.password);

[Survived] BlockStatement
backend/services/auth.service.js:35:17
   }
 
   const isMatch = await bcrypt.compare(password, user.password);
-  if (!isMatch) {
-    throw new Error("Invalid credentials");
-  }
+  if (!isMatch) {}
 
   // Generate JWT

[Survived] ObjectLiteral
backend/services/auth.service.js:43:5
   const token = jwt.sign(
     { id: user._id, role: user.role },
     process.env.JWT_SECRET,
-    { expiresIn: "1d" }
+    {}
   );
 

[Survived] StringLiteral
backend/services/auth.service.js:43:18
   const token = jwt.sign(
     { id: user._id, role: user.role },
     process.env.JWT_SECRET,
-    { expiresIn: "1d" }
+    { expiresIn: "" }
   );
 

[Survived] ObjectLiteral
backend/services/auth.service.js:46:10
     { expiresIn: "1d" }
   );
 
-  return {
-    message: "Login successful",
-    token,
-    role: user.role,
-  };
+  return {};
 };
