[Survived] BlockStatement
backend/services/patient.service.js:6:41
 const auditService = require("./audit.service"); // ✅ ADD
 
 // ✅ CREATE PATIENT
-exports.createPatient = async (data) => {
-  const patient = new Patient({
-    name: data.name,
-    age: data.age,
-    gender: data.gender,
-    contact: data.contact,
-    address: data.address,
-    diagnosis: data.diagnosis,
-    doctor: data.doctor,
-    status: "Admitted"
-  });
-
-  await patient.save();
-
-  // 🔥 AUDIT LOG
-  await auditService.createEvent({
-    patient: patient._id,
-    type: "ADMISSION",
-    description: "Patient admitted",
-    location: "Hospital",
-    staff: "Admin"
-  });
-
-  return patient;
-};
+exports.createPatient = async (data) => {};
 
 // ✅ GET ALL

[Survived] ObjectLiteral
backend/services/patient.service.js:7:31
 
 // ✅ CREATE PATIENT
 exports.createPatient = async (data) => {
-  const patient = new Patient({
-    name: data.name,
-    age: data.age,
-    gender: data.gender,
-    contact: data.contact,
-    address: data.address,
-    diagnosis: data.diagnosis,
-    doctor: data.doctor,
-    status: "Admitted"
-  });
+  const patient = new Patient({});
 
   await patient.save();

[Survived] StringLiteral
backend/services/patient.service.js:23:11
   // 🔥 AUDIT LOG
   await auditService.createEvent({
     patient: patient._id,
-    type: "ADMISSION",
+    type: "",
     description: "Patient admitted",
     location: "Hospital",

[Survived] BlockStatement
backend/services/patient.service.js:33:38
 };
 
 // ✅ GET ALL
-exports.getAllPatients = async () => {
-  return await Patient.find()
-    .populate("bed")
-    .populate("ward");
-};
+exports.getAllPatients = async () => {};
 
 // ✅ DISCHARGE

[Survived] BooleanLiteral
backend/services/patient.service.js:43:7
 exports.dischargePatient = async (patientId) => {
   const patient = await Patient.findById(patientId);
 
-  if (!patient) throw new Error("Patient not found");
+  if (patient) throw new Error("Patient not found");
 
   const bed = await Bed.findById(patient.bed);

[Survived] ConditionalExpression
backend/services/patient.service.js:43:7
 exports.dischargePatient = async (patientId) => {
   const patient = await Patient.findById(patientId);
 
-  if (!patient) throw new Error("Patient not found");
+  if (true) throw new Error("Patient not found");
 
   const bed = await Bed.findById(patient.bed);

[Survived] ConditionalExpression
backend/services/patient.service.js:47:7
 
   const bed = await Bed.findById(patient.bed);
 
-  if (bed) {
+  if (true) {
     bed.isOccupied = false;
     bed.assignedPatient = null;

[Survived] ConditionalExpression
backend/services/patient.service.js:47:7
 
   const bed = await Bed.findById(patient.bed);
 
-  if (bed) {
+  if (false) {
     bed.isOccupied = false;
     bed.assignedPatient = null;

[Survived] BooleanLiteral
backend/services/patient.service.js:48:22
   const bed = await Bed.findById(patient.bed);
 
   if (bed) {
-    bed.isOccupied = false;
+    bed.isOccupied = true;
     bed.assignedPatient = null;
     await bed.save();

[Survived] StringLiteral
backend/services/patient.service.js:55:20
 
   patient.bed = null;
   patient.ward = null;
-  patient.status = "Discharged";
+  patient.status = "";
 
   await patient.save();

[Survived] StringLiteral
backend/services/patient.service.js:64:15
     patient: patient._id,
     type: "DISCHARGE",
     description: "Patient discharged",
-    location: "Hospital",
+    location: "",
     staff: "Admin"
   });

[Survived] StringLiteral
backend/services/patient.service.js:65:12
     type: "DISCHARGE",
     description: "Patient discharged",
     location: "Hospital",
-    staff: "Admin"
+    staff: ""
   });
 
