[Survived] BlockStatement
backend/services/ward.service.js:3:38
 const Ward = require("../models/Ward");
 
-exports.createWard = async (data) => {
-  const ward = new Ward(data);
-  await ward.save();
-  return ward;
-};
+exports.createWard = async (data) => {};
 
 exports.getAllWards = async () => {

[Survived] BlockStatement
backend/services/ward.service.js:9:35
   return ward;
 };
 
-exports.getAllWards = async () => {
-  return await Ward.find();
-};
+exports.getAllWards = async () => {};
