[Killed] BlockStatement
backend/utils/bedLogic.js:1:37
-function canAssignBed(bed, patient) {
-  if (!bed) return { allowed: false, reason: "Bed not found" };
-
-  if (bed.isOccupied) {
-    return { allowed: false, reason: "Bed already occupied" };
-  }
-
-  if (!patient) {
-    return { allowed: false, reason: "Patient not found" };
-  }
-
-  return { allowed: true };
-}
+function canAssignBed(bed, patient) {}
 
 module.exports = { canAssignBed };
killedBy: Mutation Test - Bed Logic should allow assignment when valid
statusReason: Cannot read properties of undefined (reading 'allowed')

[Killed] BooleanLiteral
backend/utils/bedLogic.js:2:7
 function canAssignBed(bed, patient) {
-  if (!bed) return { allowed: false, reason: "Bed not found" };
+  if (bed) return { allowed: false, reason: "Bed not found" };
 
   if (bed.isOccupied) {
killedBy: Mutation Test - Bed Logic should allow assignment when valid
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
backend/utils/bedLogic.js:2:7
 function canAssignBed(bed, patient) {
-  if (!bed) return { allowed: false, reason: "Bed not found" };
+  if (true) return { allowed: false, reason: "Bed not found" };
 
   if (bed.isOccupied) {
killedBy: Mutation Test - Bed Logic should allow assignment when valid
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
backend/utils/bedLogic.js:4:7
 function canAssignBed(bed, patient) {
   if (!bed) return { allowed: false, reason: "Bed not found" };
 
-  if (bed.isOccupied) {
+  if (true) {
     return { allowed: false, reason: "Bed already occupied" };
   }
killedBy: Mutation Test - Bed Logic should allow assignment when valid
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
backend/utils/bedLogic.js:4:23
 function canAssignBed(bed, patient) {
   if (!bed) return { allowed: false, reason: "Bed not found" };
 
-  if (bed.isOccupied) {
-    return { allowed: false, reason: "Bed already occupied" };
-  }
+  if (bed.isOccupied) {}
 
   if (!patient) {
killedBy: Mutation Test - Bed Logic should reject if bed occupied
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
backend/utils/bedLogic.js:5:23
   if (!bed) return { allowed: false, reason: "Bed not found" };
 
   if (bed.isOccupied) {
-    return { allowed: false, reason: "Bed already occupied" };
+    return { allowed: true, reason: "Bed already occupied" };
   }
 
killedBy: Mutation Test - Bed Logic should reject if bed occupied
statusReason: Expected values to be strictly equal:

true !== false

[Survived] StringLiteral
backend/utils/bedLogic.js:5:38
   if (!bed) return { allowed: false, reason: "Bed not found" };
 
   if (bed.isOccupied) {
-    return { allowed: false, reason: "Bed already occupied" };
+    return { allowed: false, reason: "" };
   }
 

[Killed] ConditionalExpression
backend/utils/bedLogic.js:8:7
     return { allowed: false, reason: "Bed already occupied" };
   }
 
-  if (!patient) {
+  if (false) {
     return { allowed: false, reason: "Patient not found" };
   }
killedBy: Mutation Test - Bed Logic should reject if patient not found
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
backend/utils/bedLogic.js:8:7
     return { allowed: false, reason: "Bed already occupied" };
   }
 
-  if (!patient) {
+  if (patient) {
     return { allowed: false, reason: "Patient not found" };
   }
killedBy: Mutation Test - Bed Logic should allow assignment when valid
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
backend/utils/bedLogic.js:9:23
   }
 
   if (!patient) {
-    return { allowed: false, reason: "Patient not found" };
+    return { allowed: true, reason: "Patient not found" };
   }
 
killedBy: Mutation Test - Bed Logic should reject if patient not found
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ObjectLiteral
backend/utils/bedLogic.js:15:18
   return { allowed: true };
 }
 
-module.exports = { canAssignBed };
+module.exports = {};
killedBy: Mutation Test - Bed Logic should allow assignment when valid
statusReason: canAssignBed is not a function
